# Contents
## 1. Importing IC 'products_checked' dataset
## 2. Importing merged 'orders_products_combined' dataset
## 3. Merging 'order_products_combined' with 'products' 
## 4. Exporting Combined dataset

# 1. Importing IC 'products_checked' dataset

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Turning project folder into string path 
path = r'C:\Users\keirr\11-2020 Instacart Basket Analysis'

In [3]:
# Importing products_checked.csv dataset with path
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

In [4]:
# Issue with import of df_ords.csv, dropping 'unnamed' column
df_prods.drop('Unnamed: 0', axis=1, inplace=True)

In [5]:
# Checking output for df_prods
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

# 2. Importing merged 'orders_products_combined' dataset

In [6]:
# Importing orders_products_checked.pkl dataset with path
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [7]:
# Checking output of imported df
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [8]:
# Checking shape of imported df
df_orders_products_combined.shape

(32434489, 10)

In [9]:
# Dropping '_merge' column for future merge
df_orders_products_combined.drop('_merge', axis=1, inplace=True)

In [10]:
# Checking dataset before merge
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

# 3. Merging 'order_products_combined' with 'products'

In [11]:
# Both datasets contain 'product_id'

# Merging datasets with inner join
df_merged_large = df_orders_products_combined.merge(df_prods, on = 'product_id', how = 'inner', indicator = True)

In [12]:
# Checking for full-match 
df_merged_large['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [13]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [14]:
df_merged_large.shape

(32404859, 14)

# 4. Exporting Combined df

In [15]:
# Exporting combined data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))